
# Prep --------------------------------------------------------------------
load('df1.RData') #누적
load('df2.RData') #영업이익률
load('df3.RData') #전년대비 실질 매출액 증가율
source('fsQcaViz.R') #시각화 
#installKorFont() #한글 문제 해결
# Plot --------------------------------------------------------------------

plotArea(df1,c('자주성','경제성','세계화'))
plotArea(df1,c('자주성','경제성','세계화'),note1='2002',note2='2004')
plotArea(df1,c('자주성','경제성','세계화'),note1='2002',note2='2012')
plotArea(df1,c('자주성','경제성','세계화'),note1='2004',note2='2008')
plotArea(df1,c('자주성','경제성','세계화'),note1='2008',note2='2012')

plotTrend(df2,"영업이익률")
plotTrend(df3,"전년대비 실질 매출액 증가율")

plotTernary(df1,2002,2003,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2004,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2005,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2006,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2007,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2008,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2009,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2010,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2011,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2012,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2013,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2014,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2015,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2016,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2017,c('자주성','경제성','세계화')) 
plotTernary(df1,2002,2018,c('자주성','경제성','세계화')) 

